##  Project 3 - MISY408

**Load the animal_shelter data into df dataframe and display the first 5 rows**

In [150]:
import pandas as pb

df = pb.read_csv('animal_shelter.csv')
df.head()

,animal_id,animalType_breed,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,sex,intake_condition,time_in_shelter_days
0,A006100,Dog_Spinone Italiano Mix,Yellow/White,7/9/2007 0:00,3650.0,10 years old,Return to Owner,Neutered,M,Normal,0.588194
1,A047759,Dog_Dachshund,Tricolor,4/2/2004 0:00,3650.0,10 years old,Transfer,Neutered,Male,Normal,4.970139
2,A134067,Dog_Shetland Sheepdog,NaN,10/16/1997 0:00,NaN,16 years old,Return to Owner,Neutered,Male,Injured,0.119444
3,A141142,Dog_Labrador Retriever/Pit Bull,Black/White,6/1/1998 0:00,5475.0,15 years old,Return to Owner,Spayed,F,Aged,0.870833
4,A163459,Dog_Miniature Schnauzer Mix,Black/Gray,10/19/1999 0:00,5475.0,15 years old,Return to Owner,Intact,Female,Normal,0.178472

**Question 1:**

* Display the shape (number of rows and number of columns) of the dataframe

In [151]:
df.shape

(71961, 11)

* Display the list of columns in the df dataframe

In [152]:
df.columns

Index(['animal_id', 'animalType_breed', 'color', 'date_of_birth', 'age_days',
       'age_years', 'outcome_type', 'surgery_type', 'sex', 'intake_condition',
       'time_in_shelter_days'],
      dtype='object')

* Create a deep copy of df and save into df1

In [153]:
df1 = df.copy()

**Question 2: Remove Leading or Trailing Spaces for all columns**

In [154]:
df1.columns = df1.columns.str.strip()

**Question 3:**
* drop 'time_in_shelter_days' column from df1 dataftame

In [155]:
df1.drop('time_in_shelter_days',axis=1, inplace= True)

* Display the shape (number of rows and number of columns) of  df1 dataframe

In [156]:
df1.shape

(71961, 10)

**Question 4: removing duplicate rows**

* Remove Duplicate rows from df1 dataframe

In [157]:
df1.drop_duplicates(inplace=True)

* Display the shape (number of rows and number of columns) of df1 dataframe

In [158]:
df1.shape

(71957, 10)

**Question 5: Identifying missing Values**

* Show how many missing values we have in each column in df1 dataframe

In [159]:
df1.isnull().sum()

animal_id              0
animalType_breed       4
color                 16
date_of_birth          0
age_days              12
age_years              0
outcome_type           6
surgery_type          11
sex                 6772
intake_condition       0
dtype: int64

* Replace the missing values in 'age_days' column with mean of 'age_days' using fillna() method.

In [160]:
df1['age_days'].fillna(df1['age_days'].mean())

0        3650.00000
1        3650.00000
2         768.48387
3        5475.00000
4        5475.00000
            ...
71956      14.00000
71957     730.00000
71958     365.00000
71959     300.00000
71960    3650.00000
Name: age_days, Length: 71957, dtype: float64

* Replace the missing values in 'sex' column with 'Unknown' using fillna() method.

In [161]:
df1['sex'].fillna('Unknown', inplace = True)

* Replace the missing value in 'color' column with 'Unknown'

In [162]:
df1['color'].fillna('Unknown', inplace = True)

* Drop the rows that have missing values in the df1 dataframe

In [163]:
df1 = df1.dropna()

* Display the shape (number of rows and number of columns) of df1 dataframe

In [164]:
df1.shape

(71924, 10)

* Show (again) how many missing values we have in each column in df1 dataframe

In [165]:
df1.isnull().sum()

animal_id           0
animalType_breed    0
color               0
date_of_birth       0
age_days            0
age_years           0
outcome_type        0
surgery_type        0
sex                 0
intake_condition    0
dtype: int64

**Question 6: Removing redundant spaces in the middle of String**

* Display unique values in 'outcome_type' column in df1 dataframe

In [166]:
df1['outcome_type'].unique()

array(['Return to Owner', 'Transfer', 'Return      to Owner',
       'Return to   Owner', 'Adoption', 'Euthanasia', 'Return   to Owner',
       'Died', 'Rto-Adopt', 'Missing', 'Disposal', 'Relocate',
       '  Adoption', 'Euthanasia  ', '  Transfer'], dtype=object)


* In the following, type a code to remove redundant space in the middle of String in 'outcome_type' column

In [167]:
df1['outcome_type']= df1['outcome_type'].str.replace('\s+', ' ')

/Users/mazen/opt/anaconda3/envs/MISY408/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  """Entry point for launching an IPython kernel.

* Display unique values in 'outcome_type' column in df1 dataframe to make sure the spaces are removed

In [168]:
df1['outcome_type'].unique()

array(['Return to Owner', 'Transfer', 'Adoption', 'Euthanasia', 'Died',
       'Rto-Adopt', 'Missing', 'Disposal', 'Relocate', ' Adoption',
       'Euthanasia ', ' Transfer'], dtype=object)

**Question 7: Splitting data into two columns**

* Split 'animalType_breed' column into two columns: animalType column and breed column

In [169]:
df1[['animalType','breed']] = df1['animalType_breed'].str.split('_',expand = True)

* Display the first 2 rows of df1 dataframe

In [170]:
df1.head(2)

,animal_id,animalType_breed,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,sex,intake_condition,animalType,breed
0,A006100,Dog_Spinone Italiano Mix,Yellow/White,7/9/2007 0:00,3650.0,10 years old,Return to Owner,Neutered,M,Normal,Dog,Spinone Italiano Mix
1,A047759,Dog_Dachshund,Tricolor,4/2/2004 0:00,3650.0,10 years old,Transfer,Neutered,Male,Normal,Dog,Dachshund

* Drop 'animalType_breed' column from df1 dataframe

In [171]:
df1.drop("animalType_breed", axis=1, inplace=True)

* Display the first 2 rows of df1 dataframe

In [172]:
df.head(2)

,animal_id,animalType_breed,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,sex,intake_condition,time_in_shelter_days
0,A006100,Dog_Spinone Italiano Mix,Yellow/White,7/9/2007 0:00,3650.0,10 years old,Return to Owner,Neutered,M,Normal,0.588194
1,A047759,Dog_Dachshund,Tricolor,4/2/2004 0:00,3650.0,10 years old,Transfer,Neutered,Male,Normal,4.970139

**Question 8: Fixing the sex Column**

* Show unique values in sex column in df1 dataframe

In [173]:
df1['sex'].unique()

array(['M', 'Male', 'F', 'Female', 'Unknown'], dtype=object)

* Create a new column 'sex1' that:
    * Sets any Male, or M values to M
    * Sets any Female, or F values to F
    * Sets Unkown to U

In [174]:
df1.loc[(df1['sex'] == 'Male') |  (df1['sex'] == 'M'),'sex1'] = "M"
df1.loc[(df1['sex'] == 'Female') |  (df1['sex'] == 'F'),'sex1'] = "F"
df1.loc[(df1['sex'] == 'Unknown') |  (df1['sex'] == 'U'),'sex1'] = "U"

* Display the first 2 rows of df1 dataframe

In [175]:
df1.head(2)

,animal_id,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,sex,intake_condition,animalType,breed,sex1
0,A006100,Yellow/White,7/9/2007 0:00,3650.0,10 years old,Return to Owner,Neutered,M,Normal,Dog,Spinone Italiano Mix,M
1,A047759,Tricolor,4/2/2004 0:00,3650.0,10 years old,Transfer,Neutered,Male,Normal,Dog,Dachshund,M

* Create the frequency table for 'sex1' using value_counts()

In [176]:
df1['sex1'].value_counts()

M    33770
F    31389
U     6765
Name: sex1, dtype: int64

* Drop sex column from df1 dataframe

In [177]:
df1.drop('sex', axis= 1, inplace=True)

* Display the first 2 rows of df1 dataframe

In [178]:
df1.head(2)

,animal_id,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,intake_condition,animalType,breed,sex1
0,A006100,Yellow/White,7/9/2007 0:00,3650.0,10 years old,Return to Owner,Neutered,Normal,Dog,Spinone Italiano Mix,M
1,A047759,Tricolor,4/2/2004 0:00,3650.0,10 years old,Transfer,Neutered,Normal,Dog,Dachshund,M

**Question 9: Extracting Numeric Data from Text**

* Replace age_years column's value with the numeric part and convert it to **float**. Display the first 2 rows of df1.
   * For example we replace 4 years old  with 4.0
   
(You should run your code once. If you run it twice it will give error. If it gives error, you should run all above cells again)

In [179]:
df1['age_years'] = df1['age_years'].str.replace(' years old', '').astype(float)
df1.head(2)

,animal_id,color,date_of_birth,age_days,age_years,outcome_type,surgery_type,intake_condition,animalType,breed,sex1
0,A006100,Yellow/White,7/9/2007 0:00,3650.0,10.0,Return to Owner,Neutered,Normal,Dog,Spinone Italiano Mix,M
1,A047759,Tricolor,4/2/2004 0:00,3650.0,10.0,Transfer,Neutered,Normal,Dog,Dachshund,M

* Calculate  average age_years for each sex in sex1 column

In [180]:
df2 = df1[['sex1','age_years']].copy()
df2.groupby(['sex1']).mean()

      age_years
sex1
F      2.183371
M      2.272681
U      0.909483

**Question 9: Ensuring Data make sense and replacing it with valid values if needed**
* Read the animal_breeds.csv file into  dataframe called animal_breeds. Display the first 5 rows.

In [181]:
import pandas as pd

df = pb.read_csv('animal_breeds.csv')
df.head()

                      valid breeds
0                   Abyssinian Mix
1                Affenpinscher Mix
2                 Afghan Hound Mix
3  Afghan Hound/Labrador Retriever
4                      African Mix

* Use .loc and isin method to create a new column called ValidBreed in the df1 dataframe. If the breed in the df1 dataframe is invalid, the value for ValidBreed will be 0. If the breed in the df1 dataframe is valid, the value for ValidBreed will be 1.

In [182]:
df1.loc[~df1['breed'].isin(df['valid breeds']),'ValidBreed'] = 0
df1.loc[df1['breed'].isin(df['valid breeds']),'ValidBreed'] = 1

* Create a frequency table to display the number of valid breeds and the number of invalid breeds in df1 dataframe

In [183]:
df1['ValidBreed'].value_counts()

1.0    71922
0.0        2
Name: ValidBreed, dtype: int64

* Subset the df1 dataframe to show breed column and ValidBreed column for which ValidBreed's value is 0 (the output of this code will show you the invalid breeds)

In [184]:
df1[['breed','ValidBreed']].loc[df1['ValidBreed'] == 0]

                    breed  ValidBreed
31575            Siam Mix         0.0
58916  French Pointer Mix         0.0

* In the following type a code to **drop the rows** for which breed is 'Siam Mix' or 'French Ponter Mix'.

In [185]:
df1 = df1[df1.breed != 'Siam Mix']
df1 = df1[df1.breed != 'French Pointer Mix']

* To make sure you've deleted the rows with invalid breeds, subset the df1 dataframe again to show breed column and ValidBreed column for which ValidBreed's value is 0.

In [186]:
df1[['breed','ValidBreed']].loc[df1['ValidBreed'] == 0]

Empty DataFrame
Columns: [breed, ValidBreed]
Index: []

**Question 10:**

* Convert 'date_of_birth' column's data type to date/time

In [187]:
df1['date_of_birth'] = pd.to_datetime(df1['date_of_birth'])

* Extract year from 'date_of_birth' column and save it to 'year_of_birth' column

In [188]:
df1['year_of_birth']=df1['date_of_birth'].dt.year

* Display the first 5 rows of frequency table for 'year_of_birth' column using value_counts() and head()

In [189]:
df1['year_of_birth'].value_counts().head()

2015    13061
2014    12977
2016    10218
2013     9717
2017     6683
Name: year_of_birth, dtype: int64

* Extract month name from 'date_of_birth' column and save it to 'month_of_birth' column

In [190]:
df1['month_of_birth'] = df1['date_of_birth'].dt.month

* Display the first 5 rows of frequency table for 'month_of_birth' column using value_counts() and head()

In [191]:
df1['month_of_birth'].value_counts().head()

4    8464
5    7411
3    7104
6    6122
8    6020
Name: month_of_birth, dtype: int64

* In the following type a code to display the number of  animals for each 'animalType'  that were born in 2015 (the ourput should show the animal types as labels and the numbers)

In [192]:
df1['year_of_birth'].loc[df1['year_of_birth']==2015].value_counts()

2015    13061
Name: year_of_birth, dtype: int64

* In the following type a code to display the number of Cats that were born in 2015 and their sex is F (the output should show Cat, 2015, and F as labels and the number)

In [195]:
df1[['animalType','sex1','year_of_birth']].loc[(df1['animalType'] == 'Cat') & (df1['sex1'] == 'F') & (df1['year_of_birth'] == 2015)].value_counts()

animalType  sex1  year_of_birth
Cat         F     2015             2764
dtype: int64